Задание 1
Скачайте с сайта датасет любого размера. Определите, какому фильму было выставлено больше всего оценок 5.0.

In [82]:
import pandas as pd

In [2]:
data2 = pd.read_csv('movies.csv')
data2.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [30]:
data3 = pd.read_csv('ratings.csv')
data3.head()

   userId  movieId  rating   timestamp
0       1      307     3.5  1256677221
1       1      481     3.5  1256677456
2       1     1091     1.5  1256677471
3       1     1257     4.5  1256677460
4       1     1449     4.5  1256677264

In [14]:
data_filter_5=data3[ data3.rating == 5 ]        # формируем датасет только с оценками 5,0, остальные оценки убираем.

In [31]:
data_filter_5.head()

     userId  movieId  rating   timestamp
40        3     2028     5.0   945141611
61        4       47     5.0  1113767129
107       4      296     5.0  1113767056
109       4      316     5.0  1113767120
111       4      318     5.0  1113766505

In [32]:
data_res=data_filter_5.groupby('movieId').count().sort_values(by='rating', ascending=False)
# Группируем по ID фильма, считая количество строк(оценок)
# сортируем в поряжке убывания.

In [33]:
data_res.head(1)
# Выводим первую строку. Это и есть фильм с максимальным количество оценок 5,0.

         userId  rating  timestamp
movieId
318       48762   48762      48762

In [34]:
joined = data_res.merge(data2, on='movieId', how='left')
joined.head(1)
# Обогатим полученную ранее таблицу, информацией о фильмах. Выводим только первый фильм, остальные не требуются по условию ТЗ.

,movieId,userId,rating,timestamp,title,genres
0,318,48762,48762,48762,"Shawshank Redemption, The (1994)",Crime|Drama

Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 год. Не учитывайте в расчётах отрицательные значения quantity.

In [2]:
data_power = pd.read_csv('power.csv')
data_power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [35]:
data_power[ data_power['country'].str.contains('Lat', case=False) ]['country'].unique() #Поиск верного названия Латвии

array(['Latvia'], dtype=object)

In [37]:
data_power[ data_power['country'].str.contains('Li', case=False) ]['country'].unique() #Поиск верного названия Литва

array(['Korea, Republic of', 'Lithuania', 'Australia', 'Philippines',
       'Republic of Moldova', 'Belize', 'Bolivia (Plur. State of)',
       'Dominican Republic', 'Liberia', 'Libya',
       'Venezuela (Bolivar. Rep.)', 'Mali', 'Syrian Arab Republic',
       'Somalia', 'Mongolia', 'Liechtenstein', 'Wallis and Futuna Is.'],
      dtype=object)

In [38]:
data_power[ data_power['country'].str.contains('Po', case=False) ]['country'].unique() #Поиск верного названия Польши

array(['Poland', 'Portugal', 'Singapore', 'French Polynesia'],
      dtype=object)

In [61]:
list_country=['Latvia', 'Lithuania', 'Poland']              # для удобства формируем списки, учитывая типы данных 
list_category=[4, 12, 21]                                   # в соответствующих колонках

In [67]:
data_power_filter = data_power[                            # также для удобства и наглядности отображения делаем 
    (data_power['country'].isin(list_country)) &           # переносы перед открывающимися скобками
    (data_power['category'].isin(list_category)) & 
    (data_power['quantity'] > 0)]
data_power_filter.head()

         country  year  quantity  category
11156  Lithuania  2008       1.0         4
11158  Lithuania  2006       1.0         4
11159  Lithuania  2005       1.0         4
11160  Lithuania  2004       1.0         4
11161  Lithuania  2003       1.0         4

In [69]:
data_power_filter['quantity'].sum()             # суммарное потребление ээ трех стран

733024932.0

Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas DataFrame. Вы можете взять любые страницы.

In [88]:
df_table_func=pd.read_html('https://pythonworld.ru/tipy-dannyx-v-python/stroki-funkcii-i-metody-strok.html')[0]
df_table_func.head()

,Функция или метод,Назначение
0,"S = 'str'; S = ""str""; S = '''str'''; S = """"""st...",Литералы строк
1,"S = ""s\np\ta\nbbb""",Экранированные последовательности
2,"S = r""C:\temp\new""",Неформатированные строки (подавляют экранирова...
3,"S = b""byte""",Строка байтов
4,S1 + S2,Конкатенация (сложение строк)

In [89]:
df_table_func.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 44 entries, 0 to 43
Data columns (total 2 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Функция или метод  44 non-null     object
 1   Назначение         44 non-null     object
dtypes: object(2)
memory usage: 832.0+ bytes